---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallKeyRefParam
source: html/55e58f56-eb72-82a5-c652-26bdc559f663.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallKeyRefParam Property

"Location Line"

## Syntax (C#)
```csharp
public static ForgeTypeId WallKeyRefParam { get; }
```